artillery_script/scenario_1.yaml
config:
  environments:
    local:
      target: 'http://localhost:3334'
      phases:
        - duration: 60
          arrivalRate: 100
          name: Warm up
      defaults:
        User-Agent: 'Artillery'
      payload:
        - path: 'usersToken.csv'
          fields:
            - 'userToken'
scenarios:
  - name: '예매'
    flow:
      - loop:
          - post:
              url: '/api/reservation/3'
              headers:
                authorization: '{{userToken}}'
        count: 10
# 테스트 실행 코드 : artillery.cmd run --output report.json ./artillery_script/scenario_1.yaml
# 테스트 로컬 실행 코드 : artillery run -e local --output report.json ./artillery_script/scenario_1.yaml
# 요약 보고서 html 확인 : artillery.cmd report report.json
# 요약 보고서 html 확인 : artillery report report.json