artillery_script/scenario_1.yaml
config:
  target: 'http://43.201.109.146:3334/'
  phases:
    # VU = duration * arrivalRate
    - duration: 1
      arrivalRate: 1
      name: Warm up
  defaults:
    headers:
      User-Agent: 'Artillery'
  payload:
    - path: 'usersToken.csv'
      fields:
        - 'userToken'
scenarios:
  - name: '예매'
    flow:
      - loop:
          - post:
              url: '/api/reservation/2'
              headers:
                Authorization: '{{userToken}}'
        #1인당 몇 번 할지
        # count: 1
# 테스트 실행 코드 : artillery.cmd run --output report.json ./artillery_script/scenario_1.yaml
# npx artillery run scenario_1.yaml
# 테스트 로컬 실행 코드 : artillery run -e local --output report.json ./artillery_script/scenario_1.yaml
# 요약 보고서 html 확인 : artillery.cmd report report.json

#/getReserv.html?showId=1